=begin
一.字面量（literal）：代码中能见到的值，数值，bool值，字符串等都叫字面量 
  
二.数据类型    
    
      ruby中的基本数据类型都是引用类型

1.数值类型(Number)
 
  Ruby中所有的数字都是 Numberic 类的实例，所有整数都是 Integer 的实例。Fixnum 和 Bignum之间的
转换是透明的

  a)整型(Integer)
    0 对应 octal，0x 对应 hex，0b 对应 binary，后跟一串数字。下划线字符在数字字符串中被忽略。
  ===============================================================
    a=123
    b=1_2_3
    c=0123
    d=0b1010
    e=0x123
  ===============================================================

  b)浮点型(Float)
    它们是带有小数的数字。浮点数是类 Float 的对象
  ==============================================================
    123.4                # 浮点值
    1.0e6                # 科学记数法
    4E20                 # 不是必需的
    4e+20                # 指数前的符号
  ==============================================================

2.范围类型

    一个范围表示一个区间。
    两点形式创建一个包含指定的最高值的范围
    三点形式创建一个不包含指定的最高值的范围。
    ==============================================================
    (1..5)        #==> 1, 2, 3, 4, 5
    (1...5)       #==> 1, 2, 3, 4
    ==============================================================

3.true和false
  分别为TrueClass与FalseClass的实例
4.字符类型
5.symbol类型
6.Array类型
7.Hash类型

三.数据类型转换

  ruby的整数、浮点数、字符串的类均提供了to_i,to_f,to_s三个方法，分别用于转换成整数、转换成
浮点数、转换成字符串

四.类型判断
    (1)instance_of? 方法用来判断对象是否是一个类的实例，会忽略继承
    ==============================================================
            class A;      end
            class B < A ;  end
         
            b = B.new
            b.instance_of? A  #=> false
            b.instance_of? B   #=> true
    ==============================================================

    (2)is_a?  kinde_of?这个两个方法都用来判断对象是否是一个类的实例，包括超类和module
    ==============================================================
            module M;    end
            class A
            include M
            end
            class B < A; end
       
            b = B.new
            b.is_a? A          #=> true
            b.is_a? B          #=> true
            b.is_a? M          #=> true  
    ==============================================================

五.引用传递
  在ruby中一切都是对象，而你向方法中传递的实质上是对象的引用（ object-reference）。ruby中变量都
是对象的引用。所有ruby为引用传递
  
=end