<html>
	<head>
		<meta http-equiv="Content-Type" content="text/html; charset=UTF-8">
		<title>运算符</title>
	</head>
<body>
	<?php
	/*
	 * 1.算术运算符(+ - * / %)
	 * a.他们只针对数值计算
	 * b.取余只针对整型计算，若不是整型，会自动截取为整型
	 * */
	
	
	//特殊：字符串只能自增
	$s1="a";
	$s2="A";
	$s3="abc";
	$s4="xyz";
	$s1++;$s2++;$s3++;$s4++;
	echo "s1=$s1,s2=$s2;s3=$s3,s4=$s4";    #s1=b,s2=B;s3=abd,s4=xza
	
	
	
	
	
	
	/*
	 *2.比较运算符(> >= == < <= === !== !===) 
	 * */
	
	//特殊:不同基本数据类型比较
	//a.比较的数据类型中若一方有布尔型，则转换为布尔型比较；（true > false）
	//b.否则，若一方有数值，则转换为数值比较（常规比较）
	//c.否则，若全是"纯数值字符串"，则转换为数值比较
	//d.否则，若全是"字符串"，则从前往后逐个按字符比较(ascii码比较)
	"abc">false;    #true
	 3>"12";         #false
	"3">"1";        #true
	"abc">"xyz";    #false
	
	 
	//==(值相等)与===(值与类型相等)区别
	   3=="3";        #true
	   3==="3";       #false
	
	   
	   
	   
	   
	   
	
	/*
	 * 3.逻辑运算符(&& || !)
	 * */
	
	
	
	
	
	/*
	 * 4.字符运算符(. .=)
	 * */
	
	
	   
	   
	   
	
	/*
	 * 5.赋值运算符(= += -= *= /= %= .=)
	 * $var+=value;
	 * $var=$var+value;
	 * */
	
	
	   
	   
	   
	   
	/*
	 * 6.三元运算符
	 * boolean?true:false;
	 * */
	
	
	
	   
	   
	
	/*
	 * 7.位运算符
	 * &   按位与
	 * |   按位或
	 * ~   按位取反
	 * ^   按位异或
	 * <<  按位左移
	 * >>  按位右移
	 * */
	
	   
	   
	   
	
	/*
	 * 8.数组运算符
	 * + 链接符:将右边的数组项合并到左边的数组中，若有重复键，以左边的数组项为准
	 * */
	$arr1=array("a"=>1,"b"=>2);
	$arr2=array("c"=>3,"a"=>4,"d"=>5);
	$arr3=$arr1+$arr2;
	var_dump($arr3);       #array(4) { ["a"]=> int(1) ["b"]=> int(2) 
	                       #["c"]=> int(3) ["d"]=> int(5) }
	

	
    ?>
</body>
</html>
