<?php
//-----------------------------变量------------------------------------------//
    
/**
 * 1.变量的名称和值的关系可以称为“引用”
 * 2.变量名必须以"$"开头
 * 3.定义一个变量后必须进行赋值
 * 4.isset($var):判断变量是否存在，如果存在返回true，否则返回false
 * 5.unset($var)：删除变量
 * 6.empty($var):检查一个变量是否为空,若变量不存在,或者变量存在且其值为""、0、"0"、null、false、array();则返回 TURE
 */
        
//----------------------------------常量----------------------------------------//

/**
 * 1.常量无需"$"
 * 2.常量一旦定义就不可以改变和销毁
 * 3.常量只能存储基本类型数据(整型，浮点型，布尔型，字符串)
 * 4.常量具有超全局范围
 * 5.在php中，使用一个未定义的变量时，会报错；使用一个未定义的常量时，也会报错，但会将常量名
 * 作为常量值赋值给未定义的常量
 * */
	
	//常量定义方法一: define("常量名",常量值)函数定义
	define("PI",3.14 );
	define("SCHOOL","ncu");
	
	echo "<br/>常量PI的值为".PI; 
	echo "<br/>常量SCHOOL的值为".SCHOOL;
	
	
	//常量定义方法二: const 常量名 = 常量值; 关键字定义
	const CC1 = 3.14;
	const CC2 = "php";
	
	echo "<br/>常量CC1的值为".CC1;
	echo "<br/>常量CC2的值为".CC2;
		
	//defined("常量名"): 判断常量是否存在
  var_dump(defined("PI")); //true
  var_dump(defined($s1)); //false
    
   //预定义常量
   echo "<br/>M_PI=".M_PI;         //圆周率；M_PI=3.1415926535898
   echo "<br/>PHP_OS=".PHP_OS;     //操作系统；PHP_OS=Linux
   echo "<br/>PHP_VERSION=".PHP_VERSION; //PHP版本号；PHP_VERSION=5.3.29
   
    //魔术常量(会因环境不同而发生改变)
    echo __FILE__;          //当前页面的绝对路径；/home/wu/workspace/day1/Constant.php
    echo __DIR__;           //当前页面的父目录；/home/wu/workspace/day1
    echo __LINE__;          //当前代码行；69

//----------------------------------------变量作用域---------------------------------------//

/*
 * 1.局部变量
 *      就是指在一个函数中的变量
 *      注意局部范围不能访问全局范围的变量
 * 2.全局变量
 *       就是指在函数外的变量；
 *       注意全局范围不能访问局部范围的变量
 * 3.超全局变量
 *      就是所有范围；如预定义变量($_GET，$_POST等)
 *      注意局部与全局范围都可以访问超全局变量
 * */	

//--------------------------------局部范围获取全局变量--------------------------------------//

/*
 * 1.global关键字，使用global声明一个与全局变量名相同的局部变量，，该局部变量与全局变量共同指向一个数据区(引用关系)
 * 
 * 2.使用预定义变量$GLOBALS，$GLOBALS['var']获取的就是这个全局变量本身
 * 
 * */

//-------------------------------预定义变量---------------------------------------------//
	
$_GET       #接受get传值
$_POST      #接受post传值
$_REQUEST   #接受get与post传值,request先接受get变量后接受post变量,所有当变量同名时。post变量覆盖get变量
$GLOBALS    #存储了全局变量
$_SERVER    #携带浏览器与服务器的一些信息
 
//------------------------------$_COOKIE---------------------------------------------//

if(isset($_COOKIE["user"])){
    echo "welcome ".$_COOKIE['user'];
}else{
    setcookie("user","zhangsan",time()+3600);
} 
setcookie("name", "", time()-3600);//删除cookie

//-------------------------------$_SESSION--------------------------------------------//

session_start();//开启session
if(isset($_SESSION['name'])){
    echo "Welcome ".$_SESSION['name'];
}else{
   $_SESSION['name']='zhangsan';
}
unset($_SESSION['name']);//局部销毁           
session_destroy()//彻底销毁 session